Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_hyperflash.c
	/* Erase Sector  */
	[4 * HYPERFLASH_CMD_LUT_SEQ_IDX_ERASESECTOR] =
		FLEXSPI_LUT_SEQ(kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x00, kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x00),
	[4 * HYPERFLASH_CMD_LUT_SEQ_IDX_ERASESECTOR + 1] = FLEXSPI_LUT_SEQ(
		kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x00, kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0xAA), // ADDR 0x555
	[4 * HYPERFLASH_CMD_LUT_SEQ_IDX_ERASESECTOR + 2] =
		FLEXSPI_LUT_SEQ(kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x00, kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x05),
	[4 * HYPERFLASH_CMD_LUT_SEQ_IDX_ERASESECTOR + 3] = FLEXSPI_LUT_SEQ(
		kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x00, kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x80), // DATA 0x80
	[4 * HYPERFLASH_CMD_LUT_SEQ_IDX_ERASESECTOR + 4] =
		FLEXSPI_LUT_SEQ(kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x00, kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x00),
	[4 * HYPERFLASH_CMD_LUT_SEQ_IDX_ERASESECTOR + 5] =
		FLEXSPI_LUT_SEQ(kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x00, kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0xAA),
	[4 * HYPERFLASH_CMD_LUT_SEQ_IDX_ERASESECTOR + 6] =
		FLEXSPI_LUT_SEQ(kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x00, kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x05),
	[4 * HYPERFLASH_CMD_LUT_SEQ_IDX_ERASESECTOR + 7] = FLEXSPI_LUT_SEQ(
		kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x00, kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0xAA), // ADDR 0x555
	[4 * HYPERFLASH_CMD_LUT_SEQ_IDX_ERASESECTOR + 8] =
		FLEXSPI_LUT_SEQ(kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x00, kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x00),
	[4 * HYPERFLASH_CMD_LUT_SEQ_IDX_ERASESECTOR + 9] =
		FLEXSPI_LUT_SEQ(kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x00, kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x55),
	[4 * HYPERFLASH_CMD_LUT_SEQ_IDX_ERASESECTOR + 10] =
		FLEXSPI_LUT_SEQ(kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x00, kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x02),
	[4 * HYPERFLASH_CMD_LUT_SEQ_IDX_ERASESECTOR + 11] =
		FLEXSPI_LUT_SEQ(kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x00, kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x55),
	[4 * HYPERFLASH_CMD_LUT_SEQ_IDX_ERASESECTOR + 12] =
		FLEXSPI_LUT_SEQ(kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x00, kFLEXSPI_Command_RADDR_DDR, kFLEXSPI_8PAD, 0x18),
	[4 * HYPERFLASH_CMD_LUT_SEQ_IDX_ERASESECTOR + 13] =
		FLEXSPI_LUT_SEQ(kFLEXSPI_Command_CADDR_DDR, kFLEXSPI_8PAD, 0x10, kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x00),
	[4 * HYPERFLASH_CMD_LUT_SEQ_IDX_ERASESECTOR + 14] =
		FLEXSPI_LUT_SEQ(kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x30, kFLEXSPI_Command_STOP, kFLEXSPI_1PAD, 0x00),

	/* program page */
	[4 * HYPERFLASH_CMD_LUT_SEQ_IDX_PAGEPROGRAM] =
		FLEXSPI_LUT_SEQ(kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x00, kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x00),
	[4 * HYPERFLASH_CMD_LUT_SEQ_IDX_PAGEPROGRAM + 1] = FLEXSPI_LUT_SEQ(
		kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x00, kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0xAA), // ADDR 0x555
	[4 * HYPERFLASH_CMD_LUT_SEQ_IDX_PAGEPROGRAM + 2] =
		FLEXSPI_LUT_SEQ(kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x00, kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x05),
	[4 * HYPERFLASH_CMD_LUT_SEQ_IDX_PAGEPROGRAM + 3] = FLEXSPI_LUT_SEQ(
		kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x00, kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0xA0), // DATA 0xA0
	[4 * HYPERFLASH_CMD_LUT_SEQ_IDX_PAGEPROGRAM + 4] =
		FLEXSPI_LUT_SEQ(kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x00, kFLEXSPI_Command_RADDR_DDR, kFLEXSPI_8PAD, 0x18),
	[4 * HYPERFLASH_CMD_LUT_SEQ_IDX_PAGEPROGRAM + 5] = FLEXSPI_LUT_SEQ(
		kFLEXSPI_Command_CADDR_DDR, kFLEXSPI_8PAD, 0x10, kFLEXSPI_Command_WRITE_DDR, kFLEXSPI_8PAD, 0x80),
};

/************************************************************************************
 * Private Functions
 ************************************************************************************/
/************************************************************************************
 * Name: flexspi_pins_init
 *
 * Description:
 *   Initialize pin setting in flexspi
 *
 ************************************************************************************/
static inline void flexspi_pins_init(void)
{
	imxrt_clock_enableclock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03u */

	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_00_FLEXSPIB_DATA03,   /* GPIO_SD_B1_00 is configured as FLEXSPIB_DATA03 */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_00 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_01_FLEXSPIB_DATA02,   /* GPIO_SD_B1_01 is configured as FLEXSPIB_DATA02 */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_01 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_02_FLEXSPIB_DATA01,   /* GPIO_SD_B1_02 is configured as FLEXSPIB_DATA01 */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_02 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_03_FLEXSPIB_DATA00,   /* GPIO_SD_B1_03 is configured as FLEXSPIB_DATA00 */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_03 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_04_FLEXSPIB_SCLK,     /* GPIO_SD_B1_04 is configured as FLEXSPIB_SCLK */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_04 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_05_FLEXSPIA_DQS,      /* GPIO_SD_B1_05 is configured as FLEXSPIA_DQS */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_05 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_06_FLEXSPIA_SS0_B,    /* GPIO_SD_B1_06 is configured as FLEXSPIA_SS0_B */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_06 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_07_FLEXSPIA_SCLK,     /* GPIO_SD_B1_07 is configured as FLEXSPIA_SCLK */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_07 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_08_FLEXSPIA_DATA00,   /* GPIO_SD_B1_08 is configured as FLEXSPIA_DATA00 */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_08 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_09_FLEXSPIA_DATA01,   /* GPIO_SD_B1_09 is configured as FLEXSPIA_DATA01 */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_09 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_10_FLEXSPIA_DATA02,   /* GPIO_SD_B1_10 is configured as FLEXSPIA_DATA02 */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_10 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_11_FLEXSPIA_DATA03,   /* GPIO_SD_B1_11 is configured as FLEXSPIA_DATA03 */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_11 */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_00_FLEXSPIB_DATA03,   /* GPIO_SD_B1_00 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/6
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_01_FLEXSPIB_DATA02,   /* GPIO_SD_B1_01 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/6
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_02_FLEXSPIB_DATA01,   /* GPIO_SD_B1_02 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/6
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_03_FLEXSPIB_DATA00,   /* GPIO_SD_B1_03 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/6
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_04_FLEXSPIB_SCLK,     /* GPIO_SD_B1_04 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/6
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_05_FLEXSPIA_DQS,      /* GPIO_SD_B1_05 PAD functional properties : */
		0x0130F1u);                             /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/6
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Pull
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_06_FLEXSPIA_SS0_B,    /* GPIO_SD_B1_06 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/6
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_07_FLEXSPIA_SCLK,     /* GPIO_SD_B1_07 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/6
													Speed Field: max(200MHz)
													MCR0 Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_08_FLEXSPIA_DATA00,   /* GPIO_SD_B1_08 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/6
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_09_FLEXSPIA_DATA01,   /* GPIO_SD_B1_09 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/6
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_10_FLEXSPIA_DATA02,   /* GPIO_SD_B1_10 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/6
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_11_FLEXSPIA_DATA03,   /* GPIO_SD_B1_11 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
													Drive Strength Field: R0/6
													Speed Field: max(200MHz)
													Open Drain Enable Field: Open Drain Disabled
													Pull / Keep Enable Field: Pull/Keeper Enabled
													Pull / Keep Select Field: Keeper
													Pull Up / Down Config. Field: 100K Ohm Pull Down
													Hyst. Enable Field: Hysteresis Disabled */
}

/************************************************************************************
 * Name: flexspi_clock_init
 *
 * Description:
 *   Initialize clock setting in flexspi
 *
 ************************************************************************************/
static inline void flexspi_clock_init(void)
{
	const clock_usb_pll_config_t g_ccmConfigUsbPll = {.loopDivider = 0U};

