Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_hyperflash.c
	imxrt_clock_initusb1pll(&g_ccmConfigUsbPll);
	imxrt_clock_initusb1pfd(kCLOCK_Pfd0, 26);   /* Set PLL3 PFD0 clock 332MHZ. */
	imxrt_clock_setmux(kCLOCK_FlexspiMux, 0x3); /* Choose PLL3 PFD0 clock as flexspi source clock. */
	imxrt_clock_setdiv(kCLOCK_FlexspiDiv, 3);   /* flexspi clock 83M, DDR mode, internal clock 42M. */
}

/************************************************************************************
 * Name: flexspi_clock_update
 *
 * Description:
 *   Update clock setting in flexspi
 *
 ************************************************************************************/
static inline void flexspi_clock_update(void)
{
	/* Program finished, speed the clock to 166M. */
	imxrt_flexspi_enable(IMXRT_FLEXSPI, false);
	imxrt_clock_disableclock(IMXRT_FLEXSPI_CLOCK);
	imxrt_clock_setdiv(kCLOCK_FlexspiDiv, 0); /* flexspi clock 332M, DDR mode, internal clock 166M. */
	imxrt_clock_enableclock(IMXRT_FLEXSPI_CLOCK);
	imxrt_flexspi_enable(IMXRT_FLEXSPI, true);
}

/************************************************************************************
 * Public Functions
 ************************************************************************************/
/****************************************************************************
 * Public Types
 ****************************************************************************/
/************************************************************************************
 * Name: imxrt_flexspi_nor_hyperbus_read
 *
 * Description:
 *   Check if bus is busy and wait until exiting busy
 *
 ************************************************************************************/
status_t imxrt_flexspi_nor_hyperbus_read(FLEXSPI_Type *base, uint32_t addr, uint32_t *buffer, uint32_t bytes)
{
	flexspi_transfer_t flashXfer;
	status_t status;

	flashXfer.deviceAddress = addr * 2;
	flashXfer.port = kFLEXSPI_PortA1;
	flashXfer.cmdType = kFLEXSPI_Read;
	flashXfer.SeqNumber = 1;
	flashXfer.seqIndex = HYPERFLASH_CMD_LUT_SEQ_IDX_READDATA;
	flashXfer.data = buffer;
	flashXfer.dataSize = bytes;
	status = imxrt_flexspi_transferblocking(base, &flashXfer);

	if (status != kStatus_Success) {
		return status;
	}

	return status;
}

/************************************************************************************
 * Name: imxrt_flexspi_nor_hyperbus_write
 *
 * Description:
 *   Check if bus is busy and wait until exiting busy
 *
 ************************************************************************************/
status_t imxrt_flexspi_nor_hyperbus_write(FLEXSPI_Type *base, uint32_t addr, uint32_t *buffer, uint32_t bytes)
{
	flexspi_transfer_t flashXfer;
	status_t status;

	flashXfer.deviceAddress = addr * 2;
	flashXfer.port = kFLEXSPI_PortA1;
	flashXfer.cmdType = kFLEXSPI_Write;
	flashXfer.SeqNumber = 1;
	flashXfer.seqIndex = HYPERFLASH_CMD_LUT_SEQ_IDX_WRITEDATA;
	flashXfer.data = buffer;
	flashXfer.dataSize = bytes;
	status = imxrt_flexspi_transferblocking(base, &flashXfer);

	if (status != kStatus_Success) {
		return status;
	}

	return status;
}

/************************************************************************************
 * Name: imxrt_flexspi_nor_hyperflash_cfi
 *
 * Description:
 *   Initialize clock setting in flexspi
 *
 ************************************************************************************/
status_t imxrt_flexspi_nor_hyperflash_cfi(FLEXSPI_Type *base)
{
	/*
		* Read ID-CFI Parameters
		*/
	// CFI Entry
	status_t status;
	uint32_t buffer[2];
	uint32_t data = 0x9800;
	status = imxrt_flexspi_nor_hyperbus_write(base, 0x555, &data, 2);
	if (status != kStatus_Success) {
		return status;
	}

	// ID-CFI Read
	// Read Query Unique ASCII String
	status = imxrt_flexspi_nor_hyperbus_read(base, 0x10, &buffer[0], sizeof(buffer));
	if (status != kStatus_Success) {
		return status;
	}
	buffer[1] &= 0xFFFF;
	// Check that the data read out is  unicode "QRY" in big-endian order
	if ((buffer[0] != 0x52005100) || (buffer[1] != 0x5900)) {
		status = kStatus_Fail;
		return status;
	}
	// ASO Exit
	data = 0xF000;
	status = imxrt_flexspi_nor_hyperbus_write(base, 0x0, &data, 2);
	if (status != kStatus_Success) {
		return status;
	}

	return status;
}

/************************************************************************************
 * Name: imxrt_flexspi_nor_write_enable
 *
 * Description:
 *   Write data to hyper flash using flexspi interface
 *
 ************************************************************************************/
status_t imxrt_flexspi_nor_write_enable(FLEXSPI_Type *base, uint32_t baseAddr)
{
	flexspi_transfer_t flashXfer;
	status_t status;

	/* Write neable */
	flashXfer.deviceAddress = baseAddr;
	flashXfer.port = kFLEXSPI_PortA1;
	flashXfer.cmdType = kFLEXSPI_Command;
	flashXfer.SeqNumber = 2;
	flashXfer.seqIndex = HYPERFLASH_CMD_LUT_SEQ_IDX_WRITEENABLE;

	status = imxrt_flexspi_transferblocking(base, &flashXfer);

	return status;
}

/************************************************************************************
 * Name: imxrt_flexspi_nor_wait_bus_busy
 *
 * Description:
 *   Check if bus is busy and wait until exiting busy
 *
 ************************************************************************************/
status_t imxrt_flexspi_nor_wait_bus_busy(FLEXSPI_Type *base)
{
	/* Wait status ready. */
	bool isBusy;
	uint32_t readValue;
	status_t status;
	flexspi_transfer_t flashXfer;

	flashXfer.deviceAddress = 0;
	flashXfer.port = kFLEXSPI_PortA1;
	flashXfer.cmdType = kFLEXSPI_Read;
	flashXfer.SeqNumber = 2;
	flashXfer.seqIndex = HYPERFLASH_CMD_LUT_SEQ_IDX_READSTATUS;
	flashXfer.data = &readValue;
	flashXfer.dataSize = 2;

	do {
		status = imxrt_flexspi_transferblocking(base, &flashXfer);

		if (status != kStatus_Success) {
			return status;
		}
		if (readValue & 0x8000) {
			isBusy = false;
		} else {
			isBusy = true;
		}

		if (readValue & 0x3200) {
			status = kStatus_Fail;
			break;
		}

	} while (isBusy);

	return status;
}

/************************************************************************************
 * Name: imxrt_flexspi_nor_flash_erase_sector
 *
 * Description:
 *   Erase data to hyper flash using flexspi interface
 *
 ************************************************************************************/
status_t imxrt_flexspi_nor_flash_erase_sector(FLEXSPI_Type *base, uint32_t address)
{
	status_t status;
	flexspi_transfer_t flashXfer;
	irqstate_t flags;

	flags = irqsave();

	/* Write enable */
	status = imxrt_flexspi_nor_write_enable(base, address);

