Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_hyperflash.c
	if (status != kStatus_Success) {
		irqrestore(flags);
		return status;
	}

	flashXfer.deviceAddress = address;
	flashXfer.port = kFLEXSPI_PortA1;
	flashXfer.cmdType = kFLEXSPI_Command;
	flashXfer.SeqNumber = 4;
	flashXfer.seqIndex = HYPERFLASH_CMD_LUT_SEQ_IDX_ERASESECTOR;
	status = imxrt_flexspi_transferblocking(base, &flashXfer);

	if (status != kStatus_Success) {
		irqrestore(flags);
		return status;
	}

	status = imxrt_flexspi_nor_wait_bus_busy(base);

	irqrestore(flags);

	return status;
}

/************************************************************************************
 * Name: imxrt_flexspi_nor_flash_page_program
 *
 * Description:
 *   Write data to hyper flash using flexspi interface
 *
 ************************************************************************************/
status_t imxrt_flexspi_nor_flash_page_program(FLEXSPI_Type *base, uint32_t address, const uint32_t *src)
{
	status_t status;
	flexspi_transfer_t flashXfer;
	irqstate_t flags;

	flags = irqsave();

	/* Write neable */
	status = imxrt_flexspi_nor_write_enable(base, address);
	if (status != kStatus_Success) {
		irqrestore(flags);
		return status;
	}

	/* Prepare page program command */
	flashXfer.deviceAddress = address;
	flashXfer.port = kFLEXSPI_PortA1;
	flashXfer.cmdType = kFLEXSPI_Write;
	flashXfer.SeqNumber = 2;
	flashXfer.seqIndex = HYPERFLASH_CMD_LUT_SEQ_IDX_PAGEPROGRAM;
	flashXfer.data = (uint32_t *)src;
	flashXfer.dataSize = IMXRT_FLASH_PAGE_SIZE;
	status = imxrt_flexspi_transferblocking(base, &flashXfer);

	if (status != kStatus_Success) {
		irqrestore(flags);
		return status;
	}

	status = imxrt_flexspi_nor_wait_bus_busy(base);

	arch_flush_dcache(address + IMXRT_FLASH_BASE, address + IMXRT_FLASH_BASE + IMXRT_FLASH_PAGE_SIZE);

	irqrestore(flags);

	return status;
}

/* The smallest integer type that can hold the IOMUX encoding */

typedef uint16_t iomux_pinset_t;
#ifdef CONFIG_MTD_PROGMEM
size_t up_progmem_pagesize(size_t page)
{
	char tempLog[128];

	snprintf(tempLog, sizeof(tempLog), " up_progmem_pagesize called: page[%d] ", page);
	IMXLOG(tempLog);
	return IMXRT_FLASH_PAGE_SIZE;
}

size_t up_progmem_blocksize(void)
{
	char tempLog[128];

	snprintf(tempLog, sizeof(tempLog), " up_progmem_blocksize called ");
	IMXLOG(tempLog);
	return IMXRT_BLOCK_SIZE;
}

ssize_t up_progmem_getpage(size_t addr)
{
	char tempLog[128];

	snprintf(tempLog, sizeof(tempLog), " up_progmem_getpage called: addr[%d] ", addr);
	IMXLOG(tempLog);

	if (addr < IMXRT_FLASH_BASE) {
		return 0;
	}

	if (addr >= IMXRT_FLASH_TOTAL_SIZE) {
		return -EFAULT;
	}

	return addr / IMXRT_FLASH_PAGE_SIZE;
}

size_t up_progmem_getaddress(size_t page)
{
	char tempLog[128];

	snprintf(tempLog, sizeof(tempLog), " up_progmem_getaddress called: page[%d] size_t[%d]", page, sizeof(size_t));
	IMXLOG(tempLog);

	if (page >= (IMXRT_FLASH_TOTAL_SIZE/IMXRT_FLASH_PAGE_SIZE)) {
		return SIZE_MAX;
	}

	return page * IMXRT_FLASH_PAGE_SIZE + IMXRT_FLASH_BASE;
}

size_t up_progmem_npages(void)
{
	char tempLog[128];

	snprintf(tempLog, sizeof(tempLog), " up_progmem_npages called ");
	IMXLOG(tempLog);

	return (IMXRT_FLASH_TOTAL_SIZE/IMXRT_FLASH_PAGE_SIZE);
}

bool up_progmem_isuniform(void)
{
	char tempLog[128];

	snprintf(tempLog, sizeof(tempLog), " up_progmem_isuniform called ");
	IMXLOG(tempLog);
#ifdef IMXRT_FLASH_PAGE_SIZE
	return true;
#else
	return false;
#endif							/* def IMXRT_FLASH_PAGE_SIZE */
}

ssize_t up_progmem_erasepage(size_t page)
{
	status_t status;
	flexspi_transfer_t flashXfer;
	uint32_t address;

	char tempLog[128];

	snprintf(tempLog, sizeof(tempLog), " up_progmem_erasepage called: page[%d] ", page);
	IMXLOG(tempLog);

	address = up_progmem_getaddress(page);

	/* Write enable */
	status = imxrt_flexspi_nor_write_enable(IMXRT_FLEXSPI, address);

	if (status != kStatus_Success) {
		return status;
	}

	flashXfer.deviceAddress = address;
	flashXfer.port = kFLEXSPI_PortA1;
	flashXfer.cmdType = kFLEXSPI_Command;
	flashXfer.SeqNumber = 4;
	flashXfer.seqIndex = HYPERFLASH_CMD_LUT_SEQ_IDX_ERASESECTOR;
	status = imxrt_flexspi_transferblocking(IMXRT_FLEXSPI, &flashXfer);

	if (status != kStatus_Success) {
		return status;
	}

	status = imxrt_flexspi_nor_wait_bus_busy(IMXRT_FLEXSPI);

	return up_progmem_blocksize();
}

ssize_t up_progmem_ispageerased(size_t page)
{
	size_t addr;
	size_t count;
	size_t bwritten = 0;

	char tempLog[128];

	snprintf(tempLog, sizeof(tempLog), " up_progmem_ispageerased called : page[%d]", page);
	IMXLOG(tempLog);

	if (page >= IMXRT_FLASH_PAGE_SIZE) {
		return -EFAULT;
	}

	/* Verify */

	for (addr = up_progmem_getaddress(page), count = up_progmem_pagesize(page); count; count--, addr++) {
		if (getreg8(addr) != 0xff) {
			bwritten++;
		}
	}

	return bwritten;
}

ssize_t up_progmem_write(size_t addr, const void *buf, size_t count)
{
	flexspi_transfer_t flashXfer;
	status_t status;

	char tempLog[128];

	snprintf(tempLog, sizeof(tempLog), " up_progmem_write called :addr[%d]", addr);
	IMXLOG(tempLog);

	flashXfer.deviceAddress = addr * 2;
	flashXfer.port = kFLEXSPI_PortA1;
	flashXfer.cmdType = kFLEXSPI_Write;
	flashXfer.SeqNumber = 1;
	flashXfer.seqIndex = HYPERFLASH_CMD_LUT_SEQ_IDX_WRITEDATA;
	flashXfer.data = (uint32_t *)buf;
	flashXfer.dataSize = count;
	status = imxrt_flexspi_transferblocking(IMXRT_FLEXSPI, &flashXfer);

	if (status != kStatus_Success) {
		return status;
	}

	return count;
}
#else
/************************************************************************************
 * Name: up_flashinitialize
 *
 * Description:
 *   Return an initialize MTD device instance.  MTD devices are not registered
 *   in the file system, but are created as instances that can be bound to
 *   other functions (such as a block or character driver front end).
 *
 ************************************************************************************/
FAR struct mtd_dev_s *up_flashinitialize(void)
{
	return (FAR struct mtd_dev_s *)imxrt_mtd_initialize();
}
#endif

/************************************************************************************
 * Name: imxrt_flash_init
 *
 * Description:
 *   Initialize flash 
 *
 ************************************************************************************/
void imxrt_flash_init(void)
{
	flexspi_config_t config;

	flexspi_pins_init();

	flexspi_clock_init();

	/*Get FLEXSPI default settings and configure the flexspi. */
	imxrt_flexspi_getdefaultconfig(&config);
	
	/*Set AHB buffer size for reading data through AHB bus. */
	config.ahbConfig.enableAHBPrefetch = true;
	/*Allow AHB read start address do not follow the alignment requirement. */
	config.ahbConfig.enableReadAddressOpt = true;
	config.ahbConfig.enableAHBBufferable = true;
	config.ahbConfig.enableAHBCachable = true;
	/* enable diff clock and DQS */
	config.enableSckBDiffOpt = true;
	config.rxSampleClock = kFLEXSPI_ReadSampleClkExternalInputFromDqsPad;
	config.enableCombination = true;
	imxrt_flexspi_init(IMXRT_FLEXSPI, &config);

	/* Configure flash settings according to serial flash feature. */
	imxrt_flexspi_setflashconfig(IMXRT_FLEXSPI, &deviceconfig, kFLEXSPI_PortA1);

	/* Update LUT table. */
	imxrt_flexspi_updatelut(IMXRT_FLEXSPI, 0, customLUT, CUSTOM_LUT_LENGTH);

	/* Do software reset. */
	imxrt_flexspi_softwarereset(IMXRT_FLEXSPI);
}

